# Brewfile - Essential coding tools
# Generated by ds - edit to customize

# Taps
tap "jesseduffield/lazygit"

# Core dev tools
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "gcc"
brew "make"
brew "curl"
brew "unzip"
brew "gh"
brew "lazygit"

# Node.js ecosystem
brew "fnm"

# Shell enhancements
brew "zoxide"
brew "eza"
brew "atuin"

# Languages & runtimes
brew "go"
brew "rbenv"

# Utilities
brew "biome"
brew "awscli"

# Casks (GUI apps)
cask "orbstack"
cask "raycast"
